#include <iostream>

int main()
{
    /*
    Давай сделаем обобщённую версию задачи, где вводится не 5 чисел, а столько, сколько скажет пользователь.
    То есть первое введённое число обозначает, сколько чисел дальше будет введено. Например, если первое число — 5, 
    то потом вводятся сами 5 чисел.
    */
    int sum = 0; // переменная, хранящяя изначальную сумму чисел
    int n; // переменная, хранящяя кол-во итераций для цикла
    std::cout << "Write count of numbers, how much iterations do you want to do: ";
    std::cin >> n; // переменная которая даёт циклу понять, сколько итераций ему нужно совершить
    for (int i = 0; i < n; i++)
    {
        std::cout << "Write your numbers: " << std::endl;
        int number; // переменная, хранящяя число пользователя
        std::cin >> number; // вводим число
        // проверка на чётное число
        if (number % 2 != 0)
        {
            sum = number + sum; // складываем переменную sum с введеным числом пользователя
        }
        // условие, которое будет срабатывать при вводе нечётного числа
        // else
        // {
        //     std::cout << "Write only even number!" << std::endl;
        // }
    }
    std::cout << sum; // высветляем в консоли нашу сумму после работы цикла.
}